# Series and Dataframe Reindexing

### 准备

In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### Series Reindex

In [4]:
s1 = Series([1, 2, 3, 4], index=['A', 'B', 'C', 'D'])

In [5]:
s1

A    1
B    2
C    3
D    4
dtype: int64

In [9]:
s2 = s1.reindex(index=['A', 'B', 'C', 'D', 'E'])

In [10]:
s2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
dtype: float64

In [11]:
s3 = s1.reindex(index=['A', 'B', 'C', 'D', 'E'], fill_value=5)

In [12]:
s3

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [25]:
s4 = s1.reindex(index=['A', 'C', 'D'])

In [26]:
s4

A    1
C    3
D    4
dtype: int64

### DataFrame Reindex

In [13]:
df1 = DataFrame(np.random.rand(25).reshape([5, 5]), index=['A', 'B', 'D', 'E', 'F'], columns=['c1', 'c2', 'c3', 'c4', 'c5'])

In [18]:
df1

         c1        c2        c3        c4        c5
A  0.266252  0.858118  0.226755  0.076495  0.742322
B  0.433381  0.024508  0.830153  0.703704  0.535935
D  0.380950  0.002623  0.062535  0.024977  0.314737
E  0.894696  0.190311  0.561657  0.431334  0.164086
F  0.982635  0.964635  0.145410  0.307345  0.344464

In [19]:
df2 = df1.reindex(index=['A', 'B', 'C', 'D', 'E', 'F'])

In [20]:
df2

         c1        c2        c3        c4        c5
A  0.266252  0.858118  0.226755  0.076495  0.742322
B  0.433381  0.024508  0.830153  0.703704  0.535935
C       NaN       NaN       NaN       NaN       NaN
D  0.380950  0.002623  0.062535  0.024977  0.314737
E  0.894696  0.190311  0.561657  0.431334  0.164086
F  0.982635  0.964635  0.145410  0.307345  0.344464

In [21]:
df3 = df1.reindex(columns=['c1', 'c2', 'c3', 'c4', 'c5', 'c6'])

In [22]:
df3

         c1        c2        c3        c4        c5  c6
A  0.266252  0.858118  0.226755  0.076495  0.742322 NaN
B  0.433381  0.024508  0.830153  0.703704  0.535935 NaN
D  0.380950  0.002623  0.062535  0.024977  0.314737 NaN
E  0.894696  0.190311  0.561657  0.431334  0.164086 NaN
F  0.982635  0.964635  0.145410  0.307345  0.344464 NaN

In [23]:
df4 = df1.reindex(index=['A', 'B', 'C', 'D', 'E', 'F'], columns=['c1', 'c2', 'c3', 'c4', 'c5', 'c6'])

In [24]:
df4

         c1        c2        c3        c4        c5  c6
A  0.266252  0.858118  0.226755  0.076495  0.742322 NaN
B  0.433381  0.024508  0.830153  0.703704  0.535935 NaN
C       NaN       NaN       NaN       NaN       NaN NaN
D  0.380950  0.002623  0.062535  0.024977  0.314737 NaN
E  0.894696  0.190311  0.561657  0.431334  0.164086 NaN
F  0.982635  0.964635  0.145410  0.307345  0.344464 NaN

In [27]:
df5 = df1.reindex(index=['E', 'F'])

In [28]:
df5

         c1        c2        c3        c4        c5
E  0.894696  0.190311  0.561657  0.431334  0.164086
F  0.982635  0.964635  0.145410  0.307345  0.344464

### Series Drop

In [29]:
s1

A    1
B    2
C    3
D    4
dtype: int64

In [35]:
s5 = s1.drop('C')

In [36]:
s5

A    1
B    2
D    4
dtype: int64

In [37]:
s6 = s1.drop(['A', 'D'])

In [38]:
s6

B    2
C    3
dtype: int64

### DataFrame Drop

In [34]:
df1

         c1        c2        c3        c4        c5
A  0.266252  0.858118  0.226755  0.076495  0.742322
B  0.433381  0.024508  0.830153  0.703704  0.535935
D  0.380950  0.002623  0.062535  0.024977  0.314737
E  0.894696  0.190311  0.561657  0.431334  0.164086
F  0.982635  0.964635  0.145410  0.307345  0.344464

In [39]:
df6 = df1.drop('A', axis=0)

In [40]:
df6

         c1        c2        c3        c4        c5
B  0.433381  0.024508  0.830153  0.703704  0.535935
D  0.380950  0.002623  0.062535  0.024977  0.314737
E  0.894696  0.190311  0.561657  0.431334  0.164086
F  0.982635  0.964635  0.145410  0.307345  0.344464

In [42]:
df7 = df1.drop(['A', 'B', 'D'], axis=0)

In [43]:
df7

         c1        c2        c3        c4        c5
E  0.894696  0.190311  0.561657  0.431334  0.164086
F  0.982635  0.964635  0.145410  0.307345  0.344464

In [44]:
df8 = df1.drop('c3', axis=1)

In [45]:
df8

         c1        c2        c4        c5
A  0.266252  0.858118  0.076495  0.742322
B  0.433381  0.024508  0.703704  0.535935
D  0.380950  0.002623  0.024977  0.314737
E  0.894696  0.190311  0.431334  0.164086
F  0.982635  0.964635  0.307345  0.344464

In [46]:
df8 = df1.drop(['c1', 'c3', 'c5'], axis=1)

In [47]:
df8

         c2        c4
A  0.858118  0.076495
B  0.024508  0.703704
D  0.002623  0.024977
E  0.190311  0.431334
F  0.964635  0.307345